# Creating a DataFrame

In [1]:
#Createing DataFrame fro List of Lists

In [2]:
import pandas as pd

In [3]:
list_data = [["C1", 5, "Jakarta"], ["C2", 10, "Bogor"], ["C3", 7, "Tangerang"], ["C4", 0, "Jakarta"]]

In [4]:
df = pd.DataFrame(list_data, columns = ["cust_id", "item_bought", "city"])
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4            0    Jakarta

In [5]:
#Creating DataFrame from Numpy Array

In [6]:
import numpy as np

In [7]:
numpy_data = np.array(list_data)
numpy_data

array([['C1', '5', 'Jakarta'],
       ['C2', '10', 'Bogor'],
       ['C3', '7', 'Tangerang'],
       ['C4', '0', 'Jakarta']], dtype='<U11')

In [8]:
df = pd.DataFrame(numpy_data, columns = ["cust_id", "item_bought", "city"])
df

  cust_id item_bought       city
0      C1           5    Jakarta
1      C2          10      Bogor
2      C3           7  Tangerang
3      C4           0    Jakarta

In [9]:
#Creating DataFrame from Dictionary

In [10]:
dict_data = { "cust_id": ["C1", "C2", "C3", "C4"],
             "item_bought": [5,10,7,10],
             "city": ["Jakarta", "Bogor", "Tangerang", "Jakarta"]}

dict_data

{'cust_id': ['C1', 'C2', 'C3', 'C4'],
 'item_bought': [5, 10, 7, 10],
 'city': ['Jakarta', 'Bogor', 'Tangerang', 'Jakarta']}

In [11]:
df = pd.DataFrame(dict_data)
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [12]:
#Saving a DataFrame

In [13]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [14]:
df.to_csv("customer_info.csv", index = False)

In [15]:
df.to_excel("customer_info.xlsx", index = False)

In [16]:
#Load a DataFrame

In [17]:
df = pd.read_csv("customer_info.csv")
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [18]:
df = pd.read_excel("customer_info.xlsx")
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

### Basic Operations

In [19]:
#Summary Infor

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   cust_id      4 non-null      object
 1   item_bought  4 non-null      int64
 2   city         4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [21]:
#Statistics of Numerical Columns

In [22]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [23]:
df.describe()

       item_bought
count      4.00000
mean       8.00000
std        2.44949
min        5.00000
25%        6.50000
50%        8.50000
75%       10.00000
max       10.00000

In [24]:
#Columns Name

In [25]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [26]:
df.columns

Index(['cust_id', 'item_bought', 'city'], dtype='object')

In [27]:
list(df.columns)

['cust_id', 'item_bought', 'city']

In [28]:
for i in list(df.columns):
    print(i + " ?")

cust_id ?
item_bought ?
city ?

In [29]:
#DataFrame length

In [30]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [31]:
df.shape

(4, 3)

In [32]:
# banyaknya baris
df.shape[0]

4

In [33]:
# banyaknya kolom
df.shape[1]

3

In [34]:
# values of a particular column

In [35]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [39]:
df["cust_id"] # ini namanya tipe pandas series atau vector

0    C1
1    C2
2    C3
3    C4
Name: cust_id, dtype: object

In [41]:
df["item_bought"] # pandas series item_bought

0     5
1    10
2     7
3    10
Name: item_bought, dtype: int64

In [42]:
df["city"]

0      Jakarta
1        Bogor
2    Tangerang
3      Jakarta
Name: city, dtype: object

In [43]:
# Values of several columns

In [47]:
df[["cust_id","item_bought"]] # Ini bukan pandas series, tapi ini masih pandas dataframe

  cust_id  item_bought
0      C1            5
1      C2           10
2      C3            7
3      C4           10

In [48]:
df[["cust_id","city"]]

  cust_id       city
0      C1    Jakarta
1      C2      Bogor
2      C3  Tangerang
3      C4    Jakarta

In [49]:
df[["item_bought","city"]]

   item_bought       city
0            5    Jakarta
1           10      Bogor
2            7  Tangerang
3           10    Jakarta

In [50]:
# First N Row

In [51]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [58]:
df.head() # Secara Default, bakal nunjukkin 5 data

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [57]:
df.head(1)

  cust_id  item_bought     city
0      C1            5  Jakarta

In [59]:
df.head(2) # Bisa dipake buat preview data, soalnya kalau datanya banyak bisa lama nampilinnya

  cust_id  item_bought     city
0      C1            5  Jakarta
1      C2           10    Bogor

In [60]:
# Last N Rows

In [61]:
df.tail()

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [62]:
df.tail(1)

  cust_id  item_bought     city
3      C4           10  Jakarta

In [63]:
df.tail(3)

  cust_id  item_bought       city
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [65]:
# Random N Rows (Kak Stephanie lebih sering pake ini untuk liat random sample biar lebih presentatif)

In [67]:
df.sample() # Klo ga ngasih sample, dia bakal nunjukkin cuma 1 data

  cust_id  item_bought     city
3      C4           10  Jakarta

In [69]:
df.sample(3)

  cust_id  item_bought       city
2      C3            7  Tangerang
1      C2           10      Bogor
3      C4           10    Jakarta

In [70]:
# Sorting Data

In [71]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [72]:
df.sort_values(by = "item_bought", ascending = False)

  cust_id  item_bought       city
1      C2           10      Bogor
3      C4           10    Jakarta
2      C3            7  Tangerang
0      C1            5    Jakarta

In [74]:
df.sort_values(by = "item_bought")

  cust_id  item_bought       city
0      C1            5    Jakarta
2      C3            7  Tangerang
1      C2           10      Bogor
3      C4           10    Jakarta

In [76]:
df.sort_values(by = ["item_bought", "cust_id"], ascending = False) # Mengurutkan berdasarkan dua kolom

  cust_id  item_bought       city
3      C4           10    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
0      C1            5    Jakarta

In [78]:
df.sort_values(by = ["item_bought", "cust_id"], ascending = False).reset_index() # Biar index nya urut, ga acak2an

   index cust_id  item_bought       city
0      3      C4           10    Jakarta
1      1      C2           10      Bogor
2      2      C3            7  Tangerang
3      0      C1            5    Jakarta

In [80]:
df.sort_values(by = ["item_bought", "cust_id"], ascending = False).reset_index(drop = True) # Klo ga butuh index lama

  cust_id  item_bought       city
0      C4           10    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C1            5    Jakarta

In [81]:
# Rename Column

In [82]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [84]:
df.rename(columns = {"cust_id": "customer_id", "item_bought": "num_of_items"})

  customer_id  num_of_items       city
0          C1             5    Jakarta
1          C2            10      Bogor
2          C3             7  Tangerang
3          C4            10    Jakarta

In [87]:
df.columns # array of index / list

Index(['cust_id', 'item_bought', 'city'], dtype='object')